In [2]:
import pandas as pd
from sqlalchemy import create_engine
# connection string
engine = create_engine(
    "postgresql+psycopg2://udemy:udemy123@localhost:5434/udemy_master_of_pandas"
)

# read table
employees = pd.read_sql("SELECT * FROM master.employees;", engine)

In [3]:
employees

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,None
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,None,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [5]:
employees.sort_values(by = "First Name")

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
327,Aaron,Male,1/29/1994,6:48 PM,58755,5.097,True,Marketing
440,Aaron,Male,7/22/1990,2:53 PM,52119,11.343,True,Client Services
937,Aaron,None,1/22/1986,7:39 PM,63126,18.424,False,Client Services
137,Adam,Male,5/21/2011,1:45 AM,95327,15.120,False,Distribution
...,...,...,...,...,...,...,...,...
902,None,Male,5/23/2001,7:52 PM,103877,6.322,None,Distribution
925,None,Female,8/23/2000,4:19 PM,95866,19.388,None,Sales
946,None,Female,9/15/1985,1:50 AM,133472,16.941,None,Distribution
947,None,Male,7/30/2012,3:07 PM,107351,5.329,None,Marketing
951,None,Female,9/14/2010,5:19 AM,143638,9.662,None,None

In [9]:
employees.sort_values(by = "First Name" , ascending = False)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
112,Willie,Male,11/27/2003,6:21 AM,64363,4.023,False,Marketing
652,Willie,Male,12/5/2009,5:39 AM,141932,1.017,True,Engineering
450,Willie,Male,8/22/2009,1:03 PM,55038,19.691,False,Legal
175,Willie,Male,2/17/1998,8:20 PM,146651,1.451,True,Engineering
204,Willie,Male,6/6/2006,9:45 AM,55281,4.935,True,Marketing
...,...,...,...,...,...,...,...,...
902,None,Male,5/23/2001,7:52 PM,103877,6.322,None,Distribution
925,None,Female,8/23/2000,4:19 PM,95866,19.388,None,Sales
946,None,Female,9/15/1985,1:50 AM,133472,16.941,None,Distribution
947,None,Male,7/30/2012,3:07 PM,107351,5.329,None,Marketing
951,None,Female,9/14/2010,5:19 AM,143638,9.662,None,None

In [11]:
employees.sort_values(by = "First Name" , ascending = False , na_position='first')

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
7,None,Female,7/20/2015,10:43 AM,45906,11.598,None,Finance
23,None,Male,6/14/2012,4:19 PM,125792,5.042,None,None
25,None,Male,10/8/2012,1:12 AM,37076,18.576,None,Client Services
32,None,Male,8/21/1998,2:27 PM,122340,6.417,None,None
39,None,Male,1/29/2016,2:33 AM,122173,7.797,None,Client Services
...,...,...,...,...,...,...,...,...
538,Adam,Male,10/8/2010,9:53 PM,45181,3.491,False,Human Resources
327,Aaron,Male,1/29/1994,6:48 PM,58755,5.097,True,Marketing
937,Aaron,None,1/22/1986,7:39 PM,63126,18.424,False,Client Services
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
440,Aaron,Male,7/22/1990,2:53 PM,52119,11.343,True,Client Services

In [12]:
employees.sort_values(by = ["First Name" , "Salary"])

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
440,Aaron,Male,7/22/1990,2:53 PM,52119,11.343,True,Client Services
327,Aaron,Male,1/29/1994,6:48 PM,58755,5.097,True,Marketing
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
937,Aaron,None,1/22/1986,7:39 PM,63126,18.424,False,Client Services
538,Adam,Male,10/8/2010,9:53 PM,45181,3.491,False,Human Resources
...,...,...,...,...,...,...,...,...
951,None,Female,9/14/2010,5:19 AM,143638,9.662,None,None
269,None,Female,8/2/1992,8:35 PM,145316,18.517,None,Human Resources
890,None,Male,11/24/2015,3:11 AM,145329,7.100,None,Finance
628,None,None,9/2/1988,12:49 PM,147309,1.702,None,Distribution
186,None,Female,2/23/2005,9:50 PM,149654,1.825,None,Sales

In [13]:
employees.sort_values(by = ["Salary","First Name"])

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
576,Michael,Male,7/30/1993,5:35 PM,35013,14.879,False,Product
238,Kevin,Male,3/25/1982,7:31 AM,35061,5.128,False,Legal
82,Steven,Male,3/30/1980,9:20 PM,35095,8.379,True,Client Services
63,Matthew,Male,1/2/2013,10:33 PM,35203,18.040,False,Human Resources
650,Cynthia,Female,7/5/1986,1:24 AM,35381,11.749,False,Finance
...,...,...,...,...,...,...,...,...
160,Kathy,Female,3/18/2000,7:26 PM,149563,16.991,True,Finance
186,None,Female,2/23/2005,9:50 PM,149654,1.825,None,Sales
828,Cynthia,Female,7/12/2006,8:55 AM,149684,7.864,False,Product
429,Rose,Female,5/28/2015,8:40 AM,149903,5.630,False,Human Resources
644,Katherine,Female,8/13/1996,12:21 AM,149908,18.912,False,Finance

In [14]:
employees.sort_values(by = ["Salary","First Name"] , ascending=[True , False])

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
576,Michael,Male,7/30/1993,5:35 PM,35013,14.879,False,Product
238,Kevin,Male,3/25/1982,7:31 AM,35061,5.128,False,Legal
82,Steven,Male,3/30/1980,9:20 PM,35095,8.379,True,Client Services
63,Matthew,Male,1/2/2013,10:33 PM,35203,18.040,False,Human Resources
650,Cynthia,Female,7/5/1986,1:24 AM,35381,11.749,False,Finance
...,...,...,...,...,...,...,...,...
160,Kathy,Female,3/18/2000,7:26 PM,149563,16.991,True,Finance
186,None,Female,2/23/2005,9:50 PM,149654,1.825,None,Sales
828,Cynthia,Female,7/12/2006,8:55 AM,149684,7.864,False,Product
429,Rose,Female,5/28/2015,8:40 AM,149903,5.630,False,Human Resources
644,Katherine,Female,8/13/1996,12:21 AM,149908,18.912,False,Finance